Autodesk.Revit.DB.ExternalFileUtils.GetBaseForRelativePathFromDocument(Autodesk.Revit.DB.Document)
Gets the path that is the basis for relative paths from a document
Remarks:
This is the path to the central model if this is a workshared document.
Otherwise it is the path to the model file itself.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.GetFileBasedTempFolder(System.String)
Gets a temp folder based on the given file name
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.GetAllExternalFileReferences(Autodesk.Revit.DB.Document)
Gets the ids of all elements which are external file references.
Remarks:
This function will not return the ids of nested Revit links;
it only returns top-level references.
aDoc:
A Revit Document.
Returns:
The ids of all elements which are external file references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.GetExternalFileReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the external file referencing data for the given element.
aDoc:
A Revit Document.
elemId:
The element whose external file reference we want.
Returns:
An object containing path and type information for the given element's external file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elemId does not exist in the document
-or-
elemId does not represent an external file reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExternalFileUtils.IsExternalFileReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Determines whether the given element represents an external file.
Remarks:
CAD imports are not external file references, as their
data is brought fully into Revit. No connection is maintained
to the original file.
A link may be an external resource without being an external file.
aDoc:
A Revit Document.
elemId:
The element to be checked for an external file reference.
Returns:
True if the given element represents an external file; false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elemId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012